[

    {

        "title":"Our BPO Services",
        "slug":"bpo-services",
        "head_back_image":"../images/background.jpg",
        "services_back_image":"../images/background.jpg",
        "featured_data": {
            "title":"Elevate Your Business with our communication services.",
            "sub_title":"See how Specom BPO can help you in the growth of your business.",
             "featured_img":"../images/featured.jpg",
             "desc":"Specom is an outsourcing firm established in Mysore, India that provides global BPO, back office, data entry, and call center services. Our BPO outsourcing firm provides business services to a variety of sectors all around the world. Using our properly educated and unique personnel, our BPO firm executes every business operation, suited to your specific needs."

        },
        "core_title":"Our Core Services",

       
        "bpo_services":[
            {
                "title":"Customer Support",
                "slug":"customer-support",
               
            "sub_title":"We Have the Best Services to Grow Your Business.",
                  
                "desc":"We assist customers. These services are characterized as technology vendors and providers that attempt to assist consumers in using goods and services correctly, efficiently, and effectively. Customer service outsourcing might assist your company to supplement its current customer relationships. When you outsource Customer Support Services to Specom BPO Solutions, we can give you valuable insight on unmet requirements, client satisfaction levels, and customer demands. We will also suggest strategies for your company to handle customer concerns and improve customer relationships in addition to this information."
            
            
            },
            {
                "title":"Chat Support",
                "slug":"chat-support",

                "sub_title":"Quality",
                "desc":"Are you having a problem in providing your customers with Customized Chat Support at a time that is convenient for them? Are you looking for strategies to reduce your selling costs, improve sales and conversions, and develop a long-term connection with your customers? Then why not take advantage of live Chat Support for your company and create a long-term relationship with your customers? Then it's time to implement live chat assistance for your company."
            },
            {
                "title":"Call Center",
                "slug":"call-center",

                "sub_title":"We Have The Best Services To Grow Your Business.",
                "desc":"We focus on the development of our clients when providing Call Center Services. We have provided Call Center Outsourcing Services to international clients in the education, insurance, health care, travel, real estate, airlines, and banking industries. We deliver excellent customer service to help you build your brand and remain ahead of the competition."
            },
            {
                "title":"Email Support",
                "slug":"email-support",

                "sub_title":"We offer Email support services",
                "desc":"The email has now become the primary means of data transmission and customer relationship management. As a result, many companies are outsourcing their non-voice call center needs, including Email support services. We offer Email support services for technical as well as non-technical products and services."
            },
            {
                "title":"Back office",
                "slug":"back-office",

                "sub_title":"Specom employs subject specialists",
                "desc":"Outsourcing back-office support services is an easy, dependable, and cost-effective solution to manage your business's operations. It may be used for both core and non-core company functions. Back office services are not only cost-effective but also extremely productive."
            },
            {
                "title":"Medical billing",
                "slug":"medical-billing",

                "sub_title":"Enhance client satisfaction",
                "desc":"Specom is one such medical billing outsourcing services company who can be your one-stop-shop for all your medical billing needs. Medical billing is our core competency and we can efficiently manage all your billing needs. Use the services of one of the top medical billing outsourcing companies to make your task less resource consuming."
            }
        ]
    
    },
    {

        "title":"Automation and Excel Reporting",
        "slug":"automation-and-excel-reporting",
        "head_back_image":"../images/background.jpg",
        "services_back_image":"../images/background.jpg",
        "featured_data": {
            "title":"No More Manual Data Processing",
            "sub_title":"With Specom, Excel automation has become relatively simple; it reduces human errors and eliminates laborious and time-consuming activities.",
             "featured_img":"../images/featured.jpg",
             "desc":"Excel is a robust, efficient, and easy-to-use tool for data storage, calculation, organizing, and report creation. There is no question that this application has grown in popularity as a result of the constant need to access, analyze, retrieve, compute, alter, and report real-time data from small businesses to large corporations. However, connecting Excel with other applications may be time-consuming. Automation is essential for many repetitive processes, such as data retrieval, extraction, migration, import and export, and so on. Excel automation has become quite simple thanks to Specom; it avoids human mistakes and removes tedious and time-consuming tasks. It's also ten times faster than other tools and doesn't require the use of a screen. Specom runs in the background without the need for any software. It's a versatile tool that works with any spreadsheet format, including multiple header styles and column locations. Why We for Excel Automation"

        },
        "core_title":"Items We Export to the world are",


        "bpo_services":[]
       
        
    
    },
    {

        "title":"Import Export",
        "slug":"import-export",
        "head_back_image":"../images/background.jpg",
        "services_back_image":"../images/background.jpg",
        "featured_data": {
            "title":"TOTAL QUALITY ASSURED",
            "sub_title":"Our Total Quality Assurance expertise is delivered consistently with precision, pace, and passion, enabling our customers to power ahead safely.",
             "featured_img":"../images/featured.jpg",
             "desc":"Secure compliance and Total Quality Assurance of your shipments with the expertise of Specom. Focus on selling your products to your target import and export countries. Consumers, brands, and businesses may rely on Conformity Assessment Programs to ensure that their goods meet the regulatory criteria of the importing country. Consumers' health and property can be harmed by unsafe and unreliable products, and there are expenses connected with product recalls, compensation claims, and brand reputation loss."

        },

        "core_title":"Items We Export to the world are",

        "bpo_services":[
            {
                "title":"Coffee",
                "slug":"coffee",
               
            "sub_title":"We export various Coffee beans",
                  
                "desc":"  We export various Coffee beans, We have experienced and professionally qualified personnel in our export team who can handle customized orders & logistically complete the shipments before the deadline. "
            
            
            },
            {
                "title":"Tea",
                "slug":"tea",
               
            "sub_title":"We export a variety of tea products. ",
                  
                "desc":"We export a variety of tea products. Our export team consists of experienced and professionally certified employees that can handle bespoke requests and logistically complete shipments before the deadline."
            
            
            }, {
                "title":"Black pepper",
                "slug":"black_pepper",
               
            "sub_title":"Black pepper is something we export.",
                  
                "desc":"Black pepper is something we export. Our export team is made up of experienced and professionally qualified individuals that can manage special demands and logistically finish shipments ahead of schedule."
            
            
            }, {
                "title":"Curcumin",
                "slug":"curcumin",
               
            "sub_title":"We also export 95% of our Curcumin.",
                  
                "desc":"We also export 95% of our Curcumin. Our export team is made up of skilled and professionally qualified individuals that can manage unexpected demands and finish shipments ahead of schedule."
            
            
            }
        ]
       
        
    
    }, {

        "title":"ISO Certification",
        "slug":"iso-certification",
        "head_back_image":"../images/background.jpg",
        "services_back_image":"../images/background.jpg",
        "featured_data": {
            "title":"Get Your Business ISO Certified Today!",
            "sub_title":"Our ISO certification verifies that a company's management system, manufacturing process, service, or documentation method meets all of the industry's quality assurance and standards. ",
             "featured_img":"../images/featured.jpg",
             "desc":"We have the greatest specialists at Specom, who will make your certification process as simple as possible. We recognize the particular requirements of each company and work with them to obtain certification and maintain compliance with ISO rules. Our customized solutions avoid the one-size-fits-all approach and deliver the greatest outcomes in the shortest amount of time."

        },
        "core_title":"How ISO Certification Works",

        "bpo_services":[ {
            "title":"GAP Analysis",
            "slug":"gap-analysis",
           
        "sub_title":"",
              
            "desc":"We look at how different companies process the function to see if consumers' expectations are being fulfilled and, if not, what efforts should be made to make sure they are."
        
        
        },
        {
            "title":"Training",
            "slug":"training",
           
        "sub_title":"",
              
            "desc":"Our specialists will give training to the organization's team to ensure that the customer's expectations are satisfied and that all other requirements are met under ISO standards. "
        
        
        },{
            "title":"Documentation",
            "slug":"documentation",
           
        "sub_title":"",
              
            "desc":"Our knowledgeable advisors will assist you in preparing paperwork for ISO certification by the appropriate standards and will continue to update as industry requirements change."
        
        
        },{
            "title":"GAP Analysis",
            "slug":"gap-analysis",
           
        "sub_title":"",
              
            "desc":"We look at how different companies process the function to see if consumers' expectations are being fulfilled and, if not, what efforts should be made to make sure they are."
        
        
        },{
            "title":"Audit",
            "slug":"Audit",
           
        "sub_title":"",
              
            "desc":"We also assist and provide the auditing and assurance services where third-party audit is required to secure certification."
        
        
        },{
            "title":"Implementation",
            "slug":"gap-analysis",
           
        "sub_title":"",
              
            "desc":"ISO implementation includes GAP analysis, training, and documentation. Our expert will carry out all essential activities to ensure that the ISO standard is implemented inside the organization."
        
        
        },{
            "title":"Certification",
            "slug":"gap-analysis",
           
        "sub_title":"",
              
            "desc":"Our advisors will assist you in obtaining ISO certification from a well-known accreditation organization after you have successfully implemented the ISO standard."
        
        
        }]
       
        
    
    }




]